---
kind: property
id: P:Autodesk.Revit.DB.Electrical.CableTraySettings.ConnectorSeparator
source: html/5731f50d-f579-5129-7a65-767817b36ef2.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySettings.ConnectorSeparator Property

The cable tray connector separator string.

## Syntax (C#)
```csharp
public string ConnectorSeparator { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null